load_testing/load-tester.yaml
config:
  target: "https://192.168.150.133:8010"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 30
      arrivalRate: 3.4
  ensure:
    p99: 50
      
scenarios:
  - flow:
      - get:
          url: "/health"
      - post:
          url: "/rides"
          json:
            start_lat: 1
            start_long: 2
            end_lat: 3
            end_long: 4
            rider_name: "John"
            driver_name: "Jim"
            driver_vehicle: "Bicycle"
      - get:
          url: "/rides/:id/:limit"
          qs:
            id: 0
            limit: 3
      - get:
          url: "/rides/:id"
          qs:
            id: 1